Continued apply output from previous comment.
<details><summary>Show Output</summary>

```diff
s = {
          - "filename"  = "builds/bdfd549747da6fdfb5247f317d63fae8452b23a25d28d2bec5c967ba3341d016.zip"
          - "timestamp" = "1756111467139458800"
        } -> null
    }

  # module.sbeacon.module.lambda-getDatasets.aws_lambda_function.this[0] will be updated in-place
  ~ resource "aws_lambda_function" "this" {
      ~ filename                       = "builds/632488536b796872d1863707cdd11d85a1dd8af4e2f3c3ad65d230a1552cd62b.zip" -> "builds/c084b6dd6b11170da6bb662a8481e0ae630a2fa15be9c948f47a1502ef742175.zip"
        id                             = "sbeacon-backend-getDatasets"
      ~ last_modified                  = "2025-09-18T04:10:21.000+0000" -> (known after apply)
      ~ layers                         = [
          - "arn:aws:lambda:ap-southeast-3:460722568061:layer:sbeacon_backend_python_libraries_layer:14",
          - "arn:aws:lambda:ap-southeast-3:460722568061:layer:sbeacon_backend_python_modules_layer:10",
        ] -> (known after apply)
        tags                           = {
            "Environment"           = "uat"
            "NAME"                  = "sbeacon-backend"
            "Owner"                 = "gaspi"
            "terraform-aws-modules" = "lambda"
        }
        # (27 unchanged attributes hidden)

        # (4 unchanged blocks hidden)
    }

  # module.sbeacon.module.lambda-getDatasets.local_file.archive_plan[0] will be created
  + resource "local_file" "archive_plan" {
      + content              = jsonencode(
            {
              + artifacts_dir = "builds"
              + build_plan    = [
                  + [
                      + [
                          + "zip",
                          + "sbeacon/lambda/getDatasets",
                          + null,
                        ],
                    ],
                ]
              + filename      = "builds/c084b6dd6b11170da6bb662a8481e0ae630a2fa15be9c948f47a1502ef742175.zip"
              + runtime       = "python3.12"
            }
        )
      + content_base64sha256 = (known after apply)
      + content_base64sha512 = (known after apply)
      + content_md5          = (known after apply)
      + content_sha1         = (known after apply)
      + content_sha256       = (known after apply)
      + content_sha512       = (known after apply)
      + directory_permission = "0755"
      + file_permission      = "0644"
      + filename             = "builds/c084b6dd6b11170da6bb662a8481e0ae630a2fa15be9c948f47a1502ef742175.plan.json"
      + id                   = (known after apply)
    }

  # module.sbeacon.module.lambda-getDatasets.null_resource.archive[0] must be replaced
+/- resource "null_resource" "archive" {
      ~ id       = "6679880431483011088" -> (known after apply)
      ~ triggers = { # forces replacement
          ~ "filename"  = "builds/ea1f3de0a10721465a14a483aadb0553174f8a9d2a50a94198d39894335b1357.zip" -> "builds/c084b6dd6b11170da6bb662a8481e0ae630a2fa15be9c948f47a1502ef742175.zip"
          ~ "timestamp" = "1758263957634103000" -> "1758271881381715000"
        }
    }

  # module.sbeacon.module.lambda-getDatasets.null_resource.archive[0] (deposed object 91168d04) will be destroyed
  # (left over from a partially-failed replacement of this instance)
  - resource "null_resource" "archive" {
      - id       = "7695704126110082091" -> null
      - triggers = {
          - "filename"  = "builds/19039ae9583ed19cd0983db81dd4c9470a66bd4082d06488091b82fef2205c71.zip"
          - "timestamp" = "1756111467862540000"
        } -> null
    }

  # module.sbeacon.module.lambda-getDatasets.null_resource.archive[0] (deposed object e8bf1859) will be destroyed
  # (left over from a partially-failed replacement of this instance)
  - resource "null_resource" "archive" {
      - id       = "419430831239356428" -> null
      - triggers = {
          - "filename"  = "builds/632488536b796872d1863707cdd11d85a1dd8af4e2f3c3ad65d230a1552cd62b.zip"
          - "timestamp" = "1758162472535298200"
        } -> null
    }

  # module.sbeacon.module.lambda-getDatasets.null_resource.archive[0] (deposed object e9b231fe) will be destroyed
  # (left over from a partially-failed replacement of this instance)
  - resource "null_resource" "archive" {
      - id       = "3732628887703161227" -> null
      - triggers = {
          - "filename"  = "builds/6362c9f82d7b6f6f9ff710730a6ff0cd71f65872a9d7246a03d6245c5fa5aa5e.zip"
          - "timestamp" = "1758249673347523000"
        } -> null
    }

  # module.sbeacon.module.lambda-getEntryTypes.aws_lambda_function.this[0] will be updated in-place
  ~ resource "aws_lambda_function" "this" {
        id                             = "sbeacon-backend-getEntryTypes"
      ~ layers                         = [
          - "arn:aws:lambda:ap-southeast-3:460722568061:layer:sbeacon_backend_python_libraries_layer:16",
          - "arn:aws:lambda:ap-southeast-3:460722568061:layer:sbeacon_backend_python_modules_layer:12",
        ] -> (known after apply)
        tags                           = {
            "Environment"           = "uat"
            "NAME"                  = "sbeacon-backend"
            "Owner"                 = "gaspi"
            "terraform-aws-modules" = "lambda"
        }
        # (29 unchanged attributes hidden)

        # (4 unchanged blocks hidden)
    }

  # module.sbeacon.module.lambda-getEntryTypes.null_resource.archive[0] must be replaced
+/- resource "null_resource" "archive" {
      ~ id       = "1886333838600588910" -> (known after apply)
      ~ triggers = { # forces replacement
          ~ "timestamp" = "1758263958235565000" -> "1758271879966052000"
            # (1 unchanged element hidden)
        }
    }

  # module.sbeacon.module.lambda-getEntryTypes.null_resource.archive[0] (deposed object 9e27cad0) will be destroyed
  # (left over from a partially-failed replacement of this instance)
  - resource "null_resource" "archive" {
      - id       = "7100243794917045777" -> null
      - triggers = {
          - "filename"  = "builds/238c996d7bde89f739f1e7095110c69c47ce7589b588b35ea1f94beaf9b14210.zip"
          - "timestamp" = "1758249673654057000"
        } -> null
    }

  # module.sbeacon.module.lambda-getEntryTypes.null_resource.archive[0] (deposed object de72d167) will be destroyed
  # (left over from a partially-failed replacement of this instance)
  - resource "null_resource" "archive" {
      - id       = "6609370973958808229" -> null
      - triggers = {
          - "filename"  = "builds/238c996d7bde89f739f1e7095110c69c47ce7589b588b35ea1f94beaf9b14210.zip"
          - "timestamp" = "1758162472233323000"
        } -> null
    }

  # module.sbeacon.module.lambda-getEntryTypes.null_resource.archive[0] (deposed object ee1488e3) will be destroyed
  # (left over from a partially-failed replacement of this instance)
  - resource "null_resource" "archive" {
      - id       = "6782779297099141204" -> null
      - triggers = {
          - "filename"  = "builds/238c996d7bde89f739f1e7095110c69c47ce7589b588b35ea1f94beaf9b14210.zip"
          - "timestamp" = "1756111466446140000"
        } -> null
    }

  # module.sbeacon.module.lambda-getFilteringTerms.aws_lambda_function.this[0] will be updated in-place
  ~ resource "aws_lambda_function" "this" {
        id                             = "sbeacon-backend-getFilteringTerms"
      ~ layers                         = [
          - "arn:aws:lambda:ap-southeast-3:460722568061:layer:sbeacon_backend_python_libraries_layer:16",
          - "arn:aws:lambda:ap-southeast-3:460722568061:layer:sbeacon_backend_python_modules_layer:12",
        ] -> (known after apply)
        tags                           = {
            "Environment"           = "uat"
            "NAME"                  = "sbeacon-backend"
            "Owner"                 = "gaspi"
            "terraform-aws-modules" = "lambda"
        }
        # (29 unchanged attributes hidden)

        # (4 unchanged blocks hidden)
    }

  # module.sbeacon.module.lambda-getFilteringTerms.null_resource.archive[0] must be replaced
+/- resource "null_resource" "archive" {
      ~ id       = "3920232439482986452" -> (known after apply)
      ~ triggers = { # forces replacement
          ~ "timestamp" = "1758263958444803000" -> "1758271880355897000"
            # (1 unchanged element hidden)
        }
    }

  # module.sbeacon.module.lambda-getFilteringTerms.null_resource.archive[0] (deposed object 143f6912) will be destroyed
  # (left over from a partially-failed replacement of this instance)
  - resource "null_resource" "archive" {
      - id       = "6194094341039815706" -> null
      - triggers = {
          - "filename"  = "builds/454b6d5e06b61167a7515cba40e977ff31c8f2db728e6c419afec860c13d5c85.zip"
          - "timestamp" = "1758162473368834000"
        } -> null
    }

  # module.sbeacon.module.lambda-getFilteringTerms.null_resource.archive[0] (deposed object 2a4b13de) will be destroyed
  # (left over from a partially-failed replacement of this instance)
  - resource "null_resource" "archive" {
      - id       = "6785143689445204482" -> null
      - triggers = {
          - "filename"  = "builds/454b6d5e06b61167a7515cba40e977ff31c8f2db728e6c419afec860c13d5c85.zip"
          - "timestamp" = "1756111467234299800"
        } -> null
    }

  # module.sbeacon.module.lambda-getFilteringTerms.null_resource.archive[0] (deposed object 2d70139a) will be destroyed
  # (left over from a partially-failed replacement of this instance)
  - resource "null_resource" "archive" {
      - id       = "4487962623229225545" -> null
      - triggers = {
          - "filename"  = "builds/454b6d5e06b61167a7515cba40e977ff31c8f2db728e6c419afec860c13d5c85.zip"
          - "timestamp" = "1758249673855614000"
        } -> null
    }

  # module.sbeacon.module.lambda-getGenomicVariants.aws_lambda_function.this[0] will be updated in-place
  ~ resource "aws_lambda_function" "this" {
        id                             = "sbeacon-backend-getGenomicVariants"
      ~ layers                         = [
          - "arn:aws:lambda:ap-southeast-3:460722568061:layer:sbeacon_backend_python_libraries_layer:14",
          - "arn:aws:lambda:ap-southeast-3:460722568061:layer:sbeacon_backend_python_modules_layer:10",
        ] -> (known after apply)
        tags                           = {
            "Environment"           = "uat"
            "NAME"                  = "sbeacon-backend"
            "Owner"                 = "gaspi"
            "terraform-aws-modules" = "lambda"
        }
        # (29 unchanged attributes hidden)

        # (4 unchanged blocks hidden)
    }

  # module.sbeacon.module.lambda-getGenomicVariants.null_resource.archive[0] must be replaced
+/- resource "null_resource" "archive" {
      ~ id       = "6853692722630139496" -> (known after apply)
      ~ triggers = { # forces replacement
          ~ "timestamp" = "1758263957351818000" -> "1758271880830152000"
            # (1 unchanged element hidden)
        }
    }

  # module.sbeacon.module.lambda-getGenomicVariants.null_resource.archive[0] (deposed object 12bdc040) will be destroyed
  # (left over from a partially-failed replacement of this instance)
  - resource "null_resource" "archive" {
      - id       = "1965087288960448800" -> null
      - triggers = {
          - "filename"  = "builds/03cd2c3a98ebceb946ba1918b071fc2ed8a8e44431aa9ceb30659f6b1a23bb97.zip"
          - "timestamp" = "1758162472542727000"
        } -> null
    }

  # module.sbeacon.module.lambda-getGenomicVariants.null_resource.archive[0] (deposed object 2f5df225) will be destroyed
  # (left over from a partially-failed replacement of this instance)
  - resource "null_resource" "archive" {
      - id       = "8126604345263468201" -> null
      - triggers = {
          - "filename"  = "builds/03cd2c3a98ebceb946ba1918b071fc2ed8a8e44431aa9ceb30659f6b1a23bb97.zip"
          - "timestamp" = "1756111466851289000"
        } -> null
    }

  # module.sbeacon.module.lambda-getGenomicVariants.null_resource.archive[0] (deposed object f7a16f74) will be destroyed
  # (left over from a partially-failed replacement of this instance)
  - resource "null_resource" "archive" {
      - id       = "3786238793162674639" -> null
      - triggers = {
          - "filename"  = "builds/03cd2c3a98ebceb946ba1918b071fc2ed8a8e44431aa9ceb30659f6b1a23bb97.zip"
          - "timestamp" = "1758249673369207000"
        } -> null
    }

  # module.sbeacon.module.lambda-getIndividuals.aws_lambda_function.this[0] will be updated in-place
  ~ resource "aws_lambda_function" "this" {
        id                             = "sbeacon-backend-getIndividuals"
      ~ layers                         = [
          - "arn:aws:lambda:ap-southeast-3:460722568061:layer:sbeacon_backend_python_libraries_layer:14",
          - "arn:aws:lambda:ap-southeast-3:460722568061:layer:sbeacon_backend_python_modules_layer:10",
        ] -> (known after apply)
        tags                           = {
            "Environment"           = "uat"
            "NAME"                  = "sbeacon-backend"
            "Owner"                 = "gaspi"
            "terraform-aws-modules" = "lambda"
        }
        # (29 unchanged attributes hidden)

        # (4 unchanged blocks hidden)
    }

  # module.sbeacon.module.lambda-getIndividuals.null_resource.archive[0] must be replaced
+/- resource "null_resource" "archive" {
      ~ id       = "340215188312476107" -> (known after apply)
      ~ triggers = { # forces replacement
          ~ "timestamp" = "1758263957634416200" -> "1758271879851851000"
            # (1 unchanged element hidden)
        }
    }

  # module.sbeacon.module.lambda-getIndividuals.null_resource.archive[0] (deposed object 30584acf) will be destroyed
  # (left over from a partially-failed replacement of this instance)
  - resource "null_resource" "archive" {
      - id       = "8597651515416974515" -> null
      - triggers = {
          - "filename"  = "builds/54d135633142b071ec455b6045d8f1cbc9c559b03c00a6311b967298b458ab40.zip"
          - "timestamp" = "1758249672881814000"
        } -> null
    }

  # module.sbeacon.module.lambda-getIndividuals.null_resource.archive[0] (deposed object 9d654ff2) will be destroyed
  # (left over from a partially-failed replacement of this instance)
  - resource "null_resource" "archive" {
      - id       = "1223406225516832511" -> null
      - triggers = {
          - "filename"  = "builds/54d135633142b071ec455b6045d8f1cbc9c559b03c00a6311b967298b458ab40.zip"
          - "timestamp" = "1758162472444405000"
        } -> null
    }

  # module.sbeacon.module.lambda-getIndividuals.null_resource.archive[0] (deposed object d07b6153) will be destroyed
  # (left over from a partially-failed replacement of this instance)
  - resource "null_resource" "archive" {
      - id       = "3581614039743005051" -> null
      - triggers = {
          - "filename"  = "builds/54d135633142b071ec455b6045d8f1cbc9c559b03c00a6311b967298b458ab40.zip"
          - "timestamp" = "1756111466070144800"
        } -> null
    }

  # module.sbeacon.module.lambda-getInfo.aws_lambda_function.this[0] will be updated in-place
  ~ resource "aws_lambda_function" "this" {
        id                             = "sbeacon-backend-getInfo"
      ~ layers                         = [
          - "arn:aws:lambda:ap-southeast-3:460722568061:layer:sbeacon_backend_python_libraries_layer:16",
          - "arn:aws:lambda:ap-southeast-3:460722568061:layer:sbeacon_backend_python_modules_layer:12",
        ] -> (known after apply)
        tags                           = {
            "Environment"           = "uat"
            "NAME"                  = "sbeacon-backend"
            "Owner"                 = "gaspi"
            "terraform-aws-modules" = "lambda"
        }
        # (29 unchanged attributes hidden)

        # (4 unchanged blocks hidden)
    }

  # module.sbeacon.module.lambda-getInfo.null_resource.archive[0] must be replaced
+/- resource "null_resource" "archive" {
      ~ id       = "1749248652926204514" -> (known after apply)
      ~ triggers = { # forces replacement
          ~ "timestamp" = "1758263957746288000" -> "1758271880483373000"
            # (1 unchanged element hidden)
        }
    }

  # module.sbeacon.module.lambda-getInfo.null_resource.archive[0] (deposed object 451ec328) will be destroyed
  # (left over from a partially-failed replacement of this instance)
  - resource "null_resource" "archive" {
      - id       = "2222007108004146220" -> null
      - triggers = {
          - "filename"  = "builds/549ea2149ce3f8600d7817b5ad724fa92298664f34913190d9d5c78566719e70.zip"
          - "timestamp" = "1758162475670545200"
        } -> null
    }

  # module.sbeacon.module.lambda-getInfo.null_resource.archive[0] (deposed object a3a35e77) will be destroyed
  # (left over from a partially-failed replacement of this instance)
  - resource "null_resource" "archive" {
      - id       = "5474086431704061865" -> null
      - triggers = {
          - "filename"  = "builds/549ea2149ce3f8600d7817b5ad724fa92298664f34913190d9d5c78566719e70.zip"
          - "timestamp" = "1756111466422108000"
        } -> null
    }

  # module.sbeacon.module.lambda-getInfo.null_resource.archive[0] (deposed object f201b734) will be destroyed
  # (left over from a partially-failed replacement of this instance)
  - resource "null_resource" "archive" {
      - id       = "4102207934668060961" -> null
      - triggers = {
          - "filename"  = "builds/549ea2149ce3f8600d7817b5ad724fa92298664f34913190d9d5c78566719e70.zip"
          - "timestamp" = "1758249673518092000"
        } -> null
    }

  # module.sbeacon.module.lambda-getMap.aws_lambda_function.this[0] will be updated in-place
  ~ resource "aws_lambda_function" "this" {
        id                             = "sbeacon-backend-getMap"
      ~ layers                         = [
          - "arn:aws:lambda:ap-southeast-3:460722568061:layer:sbeacon_backend_python_libraries_layer:16",
          - "arn:aws:lambda:ap-southeast-3:460722568061:layer:sbeacon_backend_python_modules_layer:12",
        ] -> (known after apply)
        tags                           = {
            "Environment"           = "uat"
            "NAME"                  = "sbeacon-backend"
            "Owner"                 = "gaspi"
            "terraform-aws-modules" = "lambda"
        }
        # (29 unchanged attributes hidden)

        # (4 unchanged blocks hidden)
    }

  # module.sbeacon.module.lambda-getMap.null_resource.archive[0] must be replaced
+/- resource "null_resource" "archive" {
      ~ id       = "6116032515715717541" -> (known after apply)
      ~ triggers = { # forces replacement
          ~ "timestamp" = "1758263958522543000" -> "1758271880462578000"
            # (1 unchanged element hidden)
        }
    }

  # module.sbeacon.module.lambda-getMap.null_resource.archive[0] (deposed object 1d0c5131) will be destroyed
  # (left over from a partially-failed replacement of this instance)
  - resource "null_resource" "archive" {
      - id       = "8681426599251965849" -> null
      - triggers = {
          - "filename"  = "builds/6e74e5347aeb09443a9bcfb7a1b7f282d19c03509066e7bd1bfa6ff3d1787540.zip"
          - "timestamp" = "1758162473143224000"
        } -> null
    }

  # module.sbeacon.module.lambda-getMap.null_resource.archive[0] (deposed object 336f6c22) will be destroyed
  # (left over from a partially-failed replacement of this instance)
  - resource "null_resource" "archive" {
      - id       = "2343769833031461156" -> null
      - triggers = {
          - "filename"  = "builds/6e74e5347aeb09443a9bcfb7a1b7f282d19c03509066e7bd1bfa6ff3d1787540.zip"
          - "timestamp" = "1758249672655258000"
        } -> null
    }

  # module.sbeacon.module.lambda-getMap.null_resource.archive[0] (deposed object 397bde8f) will be destroyed
  # (left over from a partially-failed replacement of this instance)
  - resource "null_resource" "archive" {
      - id       = "3453720856251484229" -> null
      - triggers = {
          - "filename"  = "builds/6e74e5347aeb09443a9bcfb7a1b7f282d19c03509066e7bd1bfa6ff3d1787540.zip"
          - "timestamp" = "1756111467025538000"
        } -> null
    }

  # module.sbeacon.module.lambda-getProjects.aws_lambda_function.this[0] will be updated in-place
  ~ resource "aws_lambda_function" "this" {
        id                             = "sbeacon-backend-getProjects"
      ~ layers                         = [
          - "arn:aws:lambda:ap-southeast-3:460722568061:layer:sbeacon_backend_python_libraries_layer:16",
          - "arn:aws:lambda:ap-southeast-3:460722568061:layer:sbeacon_backend_python_modules_layer:12",
        ] -> (known after apply)
        tags                           = {
            "Environment"           = "uat"
            "NAME"                  = "sbeacon-backend"
            "Owner"                 = "gaspi"
            "terraform-aws-modules" = "lambda"
        }
        # (29 unchanged attributes hidden)

        # (4 unchanged blocks hidden)
    }

  # module.sbeacon.module.lambda-getProjects.null_resource.archive[0] must be replaced
+/- resource "null_resource" "archive" {
      ~ id       = "3919710022468642732" -> (known after apply)
      ~ triggers = { # forces replacement
          ~ "timestamp" = "1758263957460727000" -> "1758271881321863000"
            # (1 unchanged element hidden)
        }
    }

  # module.sbeacon.module.lambda-getProjects.null_resource.archive[0] (deposed object 1b96cf57) will be destroyed
  # (left over from a partially-failed replacement of this instance)
  - resource "null_resource" "archive" {
      - id       = "256572064713164027" -> null
      - triggers = {
          - "filename"  = "builds/aa396856c56bc316f5429db8c17f42525a5333058192b85978c8cc8f4bb30bfe.zip"
          - "timestamp" = "1758249672720316000"
        } -> null
    }

  # module.sbeacon.module.lambda-getProjects.null_resource.archive[0] (deposed object a6ecf323) will be destroyed
  # (left over from a partially-failed replacement of this instance)
  - resource "null_resource" "archive" {
      - id       = "8637098692764308353" -> null
      - triggers = {
          - "filename"  = "builds/aa396856c56bc316f5429db8c17f42525a5333058192b85978c8cc8f4bb30bfe.zip"
          - "timestamp" = "1758162472639720000"
        } -> null
    }

  # module.sbeacon.module.lambda-getProjects.null_resource.archive[0] (deposed object ec04f045) will be destroyed
  # (left over from a partially-failed replacement of this instance)
  - resource "null_resource" "archive" {
      - id       = "2775195517508396128" -> null
      - triggers = {
          - "filename"  = "builds/aa396856c56bc316f5429db8c17f42525a5333058192b85978c8cc8f4bb30bfe.zip"
          - "timestamp" = "1756111467153059000"
        } -> null
    }

  # module.sbeacon.module.lambda-getRuns.aws_lambda_function.this[0] will be updated in-place
  ~ resource "aws_lambda_function" "this" {
        id                             = "sbeacon-backend-getRuns"
      ~ layers                         = [
          - "arn:aws:lambda:ap-southeast-3:460722568061:layer:sbeacon_backend_python_libraries_layer:14",
          - "arn:aws:lambda:ap-southeast-3:460722568061:layer:sbeacon_backend_python_modules_layer:10",
        ] -> (known after apply)
        tags                           = {
            "Environment"           = "uat"
            "NAME"                  = "sbeacon-backend"
            "Owner"                 = "gaspi"
            "terraform-aws-modules" = "lambda"
        }
        # (29 unchanged attributes hidden)

        # (4 unchanged blocks hidden)
    }

  # module.sbeacon.module.lambda-getRuns.null_resource.archive[0] must be replaced
+/- resource "null_resource" "archive" {
      ~ id       = "7564965452545244531" -> (known after apply)
      ~ triggers = { # forces replacement
          ~ "timestamp" = "1758263959184376000" -> "1758271881267736000"
            # (1 unchanged element hidden)
        }
    }

  # module.sbeacon.module.lambda-getRuns.null_resource.archive[0] (deposed object 07893069) will be destroyed
  # (left over from a partially-failed replacement of this instance)
  - resource "null_resource" "archive" {
      - id       = "6418485823427558169" -> null
      - triggers = {
          - "filename"  = "builds/88930b272de54490182522f38fc6eadca926dd71de4ff726cf3de04349617ecc.zip"
          - "timestamp" = "1758162472545533800"
        } -> null
    }

  # module.sbeacon.module.lambda-getRuns.null_resource.archive[0] (deposed object d1936cf6) will be destroyed
  # (left over from a partially-failed replacement of this instance)
  - resource "null_resource" "archive" {
      - id       = "3555299184969919713" -> null
      - triggers = {
          - "filename"  = "builds/88930b272de54490182522f38fc6eadca926dd71de4ff726cf3de04349617ecc.zip"
          - "timestamp" = "1758249673018873000"
        } -> null
    }

  # module.sbeacon.module.lambda-getRuns.null_resource.archive[0] (deposed object ead21274) will be destroyed
  # (left over from a partially-failed replacement of this instance)
  - resource "null_resource" "archive" {
      - id       = "1066526251903281085" -> null
      - triggers = {
          - "filename"  = "builds/88930b272de54490182522f38fc6eadca926dd71de4ff726cf3de04349617ecc.zip"
          - "timestamp" = "1756111467742392000"
        } -> null
    }

  # module.sbeacon.module.lambda-indexer.aws_lambda_function.this[0] will be updated in-place
  ~ resource "aws_lambda_function" "this" {
        id                             = "sbeacon-backend-indexer"
      ~ layers                         = [
          - "arn:aws:lambda:ap-southeast-3:460722568061:layer:sbeacon_backend_python_libraries_layer:16",
          - "arn:aws:lambda:ap-southeast-3:460722568061:layer:sbeacon_backend_python_modules_layer:12",
        ] -> (known after apply)
        tags                           = {
            "Environment"           = "uat"
            "NAME"                  = "sbeacon-backend"
            "Owner"                 = "gaspi"
            "terraform-aws-modules" = "lambda"
        }
        # (29 unchanged attributes hidden)

        # (4 unchanged blocks hidden)
    }

  # module.sbeacon.module.lambda-indexer.null_resource.archive[0] must be replaced
+/- resource "null_resource" "archive" {
      ~ id       = "5522133350505379323" -> (known after apply)
      ~ triggers = { # forces replacement
          ~ "timestamp" = "1758263958438371800" -> "1758271880372136200"
            # (1 unchanged element hidden)
        }
    }

  # module.sbeacon.module.lambda-indexer.null_resource.archive[0] (deposed object 14d7c22f) will be destroyed
  # (left over from a partially-failed replacement of this instance)
  - resource "null_resource" "archive" {
      - id       = "1027834277928431944" -> null
      - triggers = {
          - "filename"  = "builds/aa624c03dfdae7cc1b6f9061e4ad7e5605e073652e2540f56756ee4171caf5db.zip"
          - "timestamp" = "1758249673325023000"
        } -> null
    }

  # module.sbeacon.module.lambda-indexer.null_resource.archive[0] (deposed object 4b5f97e3) will be destroyed
  # (left over from a partially-failed replacement of this instance)
  - resource "null_resource" "archive" {
      - id       = "915700741196699367" -> null
      - triggers = {
          - "filename"  = "builds/aa624c03dfdae7cc1b6f9061e4ad7e5605e073652e2540f56756ee4171caf5db.zip"
          - "timestamp" = "1758162473963620000"
        } -> null
    }

  # module.sbeacon.module.lambda-indexer.null_resource.archive[0] (deposed object ae3e3146) will be destroyed
  # (left over from a partially-failed replacement of this instance)
  - resource "null_resource" "archive" {
      - id       = "8216712083802810948" -> null
      - triggers = {
          - "filename"  = "builds/aa624c03dfdae7cc1b6f9061e4ad7e5605e073652e2540f56756ee4171caf5db.zip"
          - "timestamp" = "1756111466964541000"
        } -> null
    }

  # module.sbeacon.module.lambda-performQuery.aws_lambda_function.this[0] will be updated in-place
  ~ resource "aws_lambda_function" "this" {
        id                             = "sbeacon-backend-performQuery"
      ~ layers                         = [
          - "arn:aws:lambda:ap-southeast-3:460722568061:layer:sbeacon_backend_binaries_layer:12",
          - "arn:aws:lambda:ap-southeast-3:460722568061:layer:sbeacon_backend_python_libraries_layer:16",
          - "arn:aws:lambda:ap-southeast-3:460722568061:layer:sbeacon_backend_python_modules_layer:12",
        ] -> (known after apply)
        tags                           = {
            "Environment"           = "uat"
            "NAME"                  = "sbeacon-backend"
            "Owner"                 = "gaspi"
            "terraform-aws-modules" = "lambda"
        }
        # (29 unchanged attributes hidden)

        # (4 unchanged blocks hidden)
    }

  # module.sbeacon.module.lambda-performQuery.null_resource.archive[0] must be replaced
+/- resource "null_resource" "archive" {
      ~ id       = "5990820414953744237" -> (known after apply)
      ~ triggers = { # forces replacement
          ~ "timestamp" = "1758263957228358000" -> "1758271880544203000"
            # (1 unchanged element hidden)
        }
    }

  # module.sbeacon.module.lambda-performQuery.null_resource.archive[0] (deposed object 62d36643) will be destroyed
  # (left over from a partially-failed replacement of this instance)
  - resource "null_resource" "archive" {
      - id       = "6727874176547646979" -> null
      - triggers = {
          - "filename"  = "builds/ed9c4d15f50553a43a1fbe829043aee893846f7ad048b424e36c5ecf460120d1.zip"
          - "timestamp" = "1758162472857891000"
        } -> null
    }

  # module.sbeacon.module.lambda-performQuery.null_resource.archive[0] (deposed object a35ff702) will be destroyed
  # (left over from a partially-failed replacement of this instance)
  - resource "null_resource" "archive" {
      - id       = "4915364255219876423" -> null
      - triggers = {
          - "filename"  = "builds/ed9c4d15f50553a43a1fbe829043aee893846f7ad048b424e36c5ecf460120d1.zip"
          - "timestamp" = "1758249673175510800"
        } -> null
    }

  # module.sbeacon.module.lambda-performQuery.null_resource.archive[0] (deposed object ef8b6178) will be destroyed
  # (left over from a partially-failed replacement of this instance)
  - resource "null_resource" "archive" {
      - id       = "463124308843956021" -> null
      - triggers = {
          - "filename"  = "builds/ed9c4d15f50553a43a1fbe829043aee893846f7ad048b424e36c5ecf460120d1.zip"
          - "timestamp" = "1756111467762225000"
        } -> null
    }

  # module.sbeacon.module.lambda-splitQuery.aws_lambda_function.this[0] will be updated in-place
  ~ resource "aws_lambda_function" "this" {
        id                             = "sbeacon-backend-splitQuery"
      ~ layers                         = [
          - "arn:aws:lambda:ap-southeast-3:460722568061:layer:sbeacon_backend_python_libraries_layer:14",
          - "arn:aws:lambda:ap-southeast-3:460722568061:layer:sbeacon_backend_python_modules_layer:10",
        ] -> (known after apply)
        tags                           = {
            "Environment"           = "uat"
            "NAME"                  = "sbeacon-backend"
            "Owner"                 = "gaspi"
            "terraform-aws-modules" = "lambda"
        }
        # (29 unchanged attributes hidden)

        # (4 unchanged blocks hidden)
    }

  # module.sbeacon.module.lambda-splitQuery.null_resource.archive[0] must be replaced
+/- resource "null_resource" "archive" {
      ~ id       = "8527632329124493690" -> (known after apply)
      ~ triggers = { # forces replacement
          ~ "timestamp" = "1758263958225033000" -> "1758271881318316000"
            # (1 unchanged element hidden)
        }
    }

  # module.sbeacon.module.lambda-splitQuery.null_resource.archive[0] (deposed object 25b9f60c) will be destroyed
  # (left over from a partially-failed replacement of this instance)
  - resource "null_resource" "archive" {
      - id       = "7022520528595515891" -> null
      - triggers = {
          - "filename"  = "builds/76408ab6569b18b2349025a9480461ae075f7db9418cd088256937bb57a8a8ac.zip"
          - "timestamp" = "1758162472724858000"
        } -> null
    }

  # module.sbeacon.module.lambda-splitQuery.null_resource.archive[0] (deposed object 5634d349) will be destroyed
  # (left over from a partially-failed replacement of this instance)
  - resource "null_resource" "archive" {
      - id       = "1098694622364436976" -> null
      - triggers = {
          - "filename"  = "builds/76408ab6569b18b2349025a9480461ae075f7db9418cd088256937bb57a8a8ac.zip"
          - "timestamp" = "1756111467366813800"
        } -> null
    }

  # module.sbeacon.module.lambda-splitQuery.null_resource.archive[0] (deposed object 63b0a40a) will be destroyed
  # (left over from a partially-failed replacement of this instance)
  - resource "null_resource" "archive" {
      - id       = "5579630853446564914" -> null
      - triggers = {
          - "filename"  = "builds/76408ab6569b18b2349025a9480461ae075f7db9418cd088256937bb57a8a8ac.zip"
          - "timestamp" = "1758249672852691000"
        } -> null
    }

  # module.sbeacon.module.lambda-submitDataset.aws_lambda_function.this[0] will be updated in-place
  ~ resource "aws_lambda_function" "this" {
        id                             = "sbeacon-backend-submitDataset"
      ~ image_uri                      = "460722568061.dkr.ecr.ap-southeast-3.amazonaws.com/sbeacon-submitdataset-lambda-containers@sha256:f2908091a4b1327b12daeab7d9d42674b773800b1c336784a00eeaf2c8b75898" -> (known after apply)
      ~ last_modified                  = "2025-09-19T06:42:39.000+0000" -> (known after apply)
        tags                           = {
            "Environment"           = "uat"
            "NAME"                  = "sbeacon-backend"
            "Owner"                 = "gaspi"
            "terraform-aws-modules" = "lambda"
        }
        # (27 unchanged attributes hidden)

        # (4 unchanged blocks hidden)
    }

  # module.sbeacon.module.lambda-updateFiles.aws_lambda_function.this[0] will be updated in-place
  ~ resource "aws_lambda_function" "this" {
        id                             = "sbeacon-backend-updateFiles"
      ~ layers                         = [
          - "arn:aws:lambda:ap-southeast-3:460722568061:layer:sbeacon_backend_binaries_layer:12",
          - "arn:aws:lambda:ap-southeast-3:460722568061:layer:sbeacon_backend_python_libraries_layer:16",
          - "arn:aws:lambda:ap-southeast-3:460722568061:layer:sbeacon_backend_python_modules_layer:12",
        ] -> (known after apply)
        tags                           = {
            "Environment"           = "uat"
            "NAME"                  = "sbeacon-backend"
            "Owner"                 = "gaspi"
            "terraform-aws-modules" = "lambda"
        }
        # (29 unchanged attributes hidden)

        # (4 unchanged blocks hidden)
    }

  # module.sbeacon.module.lambda-updateFiles.null_resource.archive[0] must be replaced
+/- resource "null_resource" "archive" {
      ~ id       = "8490849284045570897" -> (known after apply)
      ~ triggers = { # forces replacement
          ~ "timestamp" = "1758263957524474000" -> "1758271879863751000"
            # (1 unchanged element hidden)
        }
    }

  # module.sbeacon.module.lambda-updateFiles.null_resource.archive[0] (deposed object 2b737d6e) will be destroyed
  # (left over from a partially-failed replacement of this instance)
  - resource "null_resource" "archive" {
      - id       = "246867998557289780" -> null
      - triggers = {
          - "filename"  = "builds/af5bf3b9b67b07d522efa9b0e7ffedcccb023517fee892632475f08f4f7d282c.zip"
          - "timestamp" = "1758162473925234000"
        } -> null
    }

  # module.sbeacon.module.lambda-updateFiles.null_resource.archive[0] (deposed object f33ff681) will be destroyed
  # (left over from a partially-failed replacement of this instance)
  - resource "null_resource" "archive" {
      - id       = "7414289866617798995" -> null
      - triggers = {
          - "filename"  = "builds/af5bf3b9b67b07d522efa9b0e7ffedcccb023517fee892632475f08f4f7d282c.zip"
          - "timestamp" = "1758249673643318000"
        } -> null
    }

  # module.sbeacon.module.python_libraries_layer.aws_lambda_layer_version.this[0] must be replaced
+/- resource "aws_lambda_layer_version" "this" {
      ~ arn                         = "arn:aws:lambda:ap-southeast-3:460722568061:layer:sbeacon_backend_python_libraries_layer:16" -> (known after apply)
      ~ code_sha256                 = "BVQz+vGpJNF+JOz7rKL+SBrZI76EoaFg968xtMf0Zng=" -> (known after apply)
      - compatible_architectures    = [] -> null
      ~ created_date                = "2025-09-19T06:43:00.395+0000" -> (known after apply)
      ~ id                          = "arn:aws:lambda:ap-southeast-3:460722568061:layer:sbeacon_backend_python_libraries_layer:16" -> (known after apply)
      ~ layer_arn                   = "arn:aws:lambda:ap-southeast-3:460722568061:layer:sbeacon_backend_python_libraries_layer" -> (known after apply)
      ~ s3_key                      = "builds/9aaec9d44015c59c2910add19da7d3cbdf8c5e70eadaa851b430d8f7339ee26d.zip" -> "builds/9bb66f9b9167880c882dc1e8e39293b5ced117249ae9f7f41bddb2b78516ba6b.zip" # forces replacement
      + s3_object_version           = (known after apply) # forces replacement
      + signing_job_arn             = (known after apply)
      + signing_profile_version_arn = (known after apply)
      + source_code_hash            = (known after apply)
      ~ source_code_size            = 24399364 -> (known after apply)
      ~ version                     = "16" -> (known after apply)
        # (7 unchanged attributes hidden)
    }

  # module.sbeacon.module.python_libraries_layer.aws_lambda_layer_version.this[0] (deposed object 32b9acce) will be destroyed
  # (left over from a partially-failed replacement of this instance)
  - resource "aws_lambda_layer_version" "this" {
      - arn                         = "arn:aws:lambda:ap-southeast-3:460722568061:layer:sbeacon_backend_python_libraries_layer:14" -> null
      - code_sha256                 = "HncVP04J5IdNtlzUuvkTIjlUahduCrVqfT25oWkuPxU=" -> null
      - compatible_architectures    = [] -> null
      - compatible_runtimes         = [
          - "python3.12",
        ] -> null
      - created_date                = "2025-09-18T04:08:41.356+0000" -> null
      - description                 = "python libraries" -> null
      - id                          = "arn:aws:lambda:ap-southeast-3:460722568061:layer:sbeacon_backend_python_libraries_layer:14" -> null
      - layer_arn                   = "arn:aws:lambda:ap-southeast-3:460722568061:layer:sbeacon_backend_python_libraries_layer" -> null
      - layer_name                  = "sbeacon_backend_python_libraries_layer" -> null
      - region                      = "ap-southeast-3" -> null
      - s3_bucket                   = "gasi-lambda-layers-20250513021721893000000003" -> null
      - s3_key                      = "builds/758a5cf4322d5633cd248f949e27259bcb25689506b56025e4ef89cfcbad66ae.zip" -> null
      - skip_destroy                = false -> null
      - source_code_size            = 24398862 -> null
      - version                     = "14" -> null
        # (5 unchanged attributes hidden)
    }

  # module.sbeacon.module.python_libraries_layer.aws_lambda_layer_version.this[0] (deposed object 6dc36dc3) will be destroyed
  # (left over from a partially-failed replacement of this instance)
  - resource "aws_lambda_layer_version" "this" {
      - arn                         = "arn:aws:lambda:ap-southeast-3:460722568061:layer:sbeacon_backend_python_libraries_layer:13" -> null
      - code_sha256                 = "j6k0ZtYHmMBI3Z2T9yd5io9BErCYIHYqkmwSInbHb1I=" -> null
      - compatible_architectures    = [] -> null
      - compatible_runtimes         = [
          - "python3.12",
        ] -> null
      - created_date                = "2025-09-18T02:31:22.392+0000" -> null
      - description                 = "python libraries" -> null
      - id                          = "arn:aws:lambda:ap-southeast-3:460722568061:layer:sbeacon_backend_python_libraries_layer:13" -> null
      - layer_arn                   = "arn:aws:lambda:ap-southeast-3:460722568061:layer:sbeacon_backend_python_libraries_layer" -> null
      - layer_name                  = "sbeacon_backend_python_libraries_layer" -> null
      - region                      = "ap-southeast-3" -> null
      - s3_bucket                   = "gasi-lambda-layers-20250513021721893000000003" -> null
      - s3_key                      = "builds/146ce8c1c2211ece470966661adcfa55bfabfada5c69bc6001be022c8aefd799.zip" -> null
      - skip_destroy                = false -> null
      - source_code_size            = 24398600 -> null
      - version                     = "13" -> null
        # (5 unchanged attributes hidden)
    }

  # module.sbeacon.module.python_libraries_layer.aws_lambda_layer_version.this[0] (deposed object b67e4458) will be destroyed
  # (left over from a partially-failed replacement of this instance)
  - resource "aws_lambda_layer_version" "this" {
      - arn                         = "arn:aws:lambda:ap-southeast-3:460722568061:layer:sbeacon_backend_python_libraries_layer:15" -> null
      - code_sha256                 = "HYH5aant8A50mdlRq1gnRVHGOZ0jX4DYLjKQPxry+8c=" -> null
      - compatible_architectures    = [] -> null
      - compatible_runtimes         = [
          - "python3.12",
        ] -> null
      - created_date                = "2025-09-19T02:44:41.745+0000" -> null
      - description                 = "python libraries" -> null
      - id                          = "arn:aws:lambda:ap-southeast-3:460722568061:layer:sbeacon_backend_python_libraries_layer:15" -> null
      - layer_arn                   = "arn:aws:lambda:ap-southeast-3:460722568061:layer:sbeacon_backend_python_libraries_layer" -> null
      - layer_name                  = "sbeacon_backend_python_libraries_layer" -> null
      - region                      = "ap-southeast-3" -> null
      - s3_bucket                   = "gasi-lambda-layers-20250513021721893000000003" -> null
      - s3_key                      = "builds/00872f7f0f46a9ca1b444b165065d07f5bdead9fa47b0069612ec2a3fab69052.zip" -> null
      - skip_destroy                = false -> null
      - source_code_size            = 24399057 -> null
      - version                     = "15" -> null
        # (5 unchanged attributes hidden)
    }

  # module.sbeacon.module.python_libraries_layer.aws_lambda_layer_version.this[0] (deposed object f5bff3a6) will be destroyed
  # (left over from a partially-failed replacement of this instance)
  - resource "aws_lambda_layer_version" "this" {
      - arn                         = "arn:aws:lambda:ap-southeast-3:460722568061:layer:sbeacon_backend_python_libraries_layer:12" -> null
      - code_sha256                 = "i/7ThOHl2+kyodyc5uJgOrNmCMMPN7xZPSGbpIcDIBc=" -> null
      - compatible_architectures    = [] -> null
      - compatible_runtimes         = [
          - "python3.12",
        ] -> null
      - created_date                = "2025-08-25T08:48:27.133+0000" -> null
      - description                 = "python libraries" -> null
      - id                          = "arn:aws:lambda:ap-southeast-3:460722568061:layer:sbeacon_backend_python_libraries_layer:12" -> null
      - layer_arn                   = "arn:aws:lambda:ap-southeast-3:460722568061:layer:sbeacon_backend_python_libraries_layer" -> null
      - layer_name                  = "sbeacon_backend_python_libraries_layer" -> null
      - region                      = "ap-southeast-3" -> null
      - s3_bucket                   = "gasi-lambda-layers-20250513021721893000000003" -> null
      - s3_key                      = "builds/3561ae79de6e4055e129534af3823910859d2d0e4711b6a12881aa70715f8c36.zip" -> null
      - skip_destroy                = false -> null
      - source_code_size            = 24397892 -> null
      - version                     = "12" -> null
        # (5 unchanged attributes hidden)
    }

  # module.sbeacon.module.python_libraries_layer.aws_s3_object.lambda_package[0] must be replaced
+/- resource "aws_s3_object" "lambda_package" {
      ~ arn                           = "arn:aws:s3:::gasi-lambda-layers-20250513021721893000000003/builds/9aaec9d44015c59c2910add19da7d3cbdf8c5e70eadaa851b430d8f7339ee26d.zip" -> (known after apply)
      ~ bucket_key_enabled            = false -> (known after apply)
      + checksum_crc32                = (known after apply)
      + checksum_crc32c               = (known after apply)
      + checksum_crc64nvme            = (known after apply)
      + checksum_sha1                 = (known after apply)
      + checksum_sha256               = (known after apply)
      ~ content_type                  = "binary/octet-stream" -> (known after apply)
      ~ etag                          = "35024b08403f793cb2e3881d4324f142-5" -> (known after apply)
      ~ id                            = "gasi-lambda-layers-20250513021721893000000003/builds/9aaec9d44015c59c2910add19da7d3cbdf8c5e70eadaa851b430d8f7339ee26d.zip" -> (known after apply)
      ~ key                           = "builds/9aaec9d44015c59c2910add19da7d3cbdf8c5e70eadaa851b430d8f7339ee26d.zip" -> "builds/9bb66f9b9167880c882dc1e8e39293b5ced117249ae9f7f41bddb2b78516ba6b.zip" # forces replacement
      + kms_key_id                    = (known after apply)
      - metadata                      = {} -> null
      ~ server_side_encryption        = "AES256" -> (known after apply)
      ~ source                        = "builds/9aaec9d44015c59c2910add19da7d3cbdf8c5e70eadaa851b430d8f7339ee26d.zip" -> "builds/9bb66f9b9167880c882dc1e8e39293b5ced117249ae9f7f41bddb2b78516ba6b.zip"
      - tags                          = {} -> null
      + version_id                    = (known after apply)
        # (14 unchanged attributes hidden)
    }

  # module.sbeacon.module.python_libraries_layer.aws_s3_object.lambda_package[0] (deposed object 4d70d168) will be destroyed
  # (left over from a partially-failed replacement of this instance)
  - resource "aws_s3_object" "lambda_package" {
      - acl                           = "private" -> null
      - arn                           = "arn:aws:s3:::gasi-lambda-layers-20250513021721893000000003/builds/758a5cf4322d5633cd248f949e27259bcb25689506b56025e4ef89cfcbad66ae.zip" -> null
      - bucket                        = "gasi-lambda-layers-20250513021721893000000003" -> null
      - bucket_key_enabled            = false -> null
      - content_type                  = "binary/octet-stream" -> null
      - etag                          = "a090c620624014173e0a7d9993464a5d-5" -> null
      - force_destroy                 = false -> null
      - id                            = "gasi-lambda-layers-20250513021721893000000003/builds/758a5cf4322d5633cd248f949e27259bcb25689506b56025e4ef89cfcbad66ae.zip" -> null
      - key                           = "builds/758a5cf4322d5633cd248f949e27259bcb25689506b56025e4ef89cfcbad66ae.zip" -> null
      - metadata                      = {} -> null
      - region                        = "ap-southeast-3" -> null
      - server_side_encryption        = "AES256" -> null
      - source                        = "builds/758a5cf4322d5633cd248f949e27259bcb25689506b56025e4ef89cfcbad66ae.zip" -> null
      - storage_class                 = "ONEZONE_IA" -> null
      - tags                          = {} -> null
      - tags_all                      = {
          - "Environment" = "uat"
          - "NAME"        = "sbeacon-backend"
          - "Owner"       = "gaspi"
        } -> null
        # (14 unchanged attributes hidden)
    }

  # module.sbeacon.module.python_libraries_layer.aws_s3_object.lambda_package[0] (deposed object 87ce8255) will be destroyed
  # (left over from a partially-failed replacement of this instance)
  - resource "aws_s3_object" "lambda_package" {
      - acl                           = "private" -> null
      - arn                           = "arn:aws:s3:::gasi-lambda-layers-20250513021721893000000003/builds/146ce8c1c2211ece470966661adcfa55bfabfada5c69bc6001be022c8aefd799.zip" -> null
      - bucket                        = "gasi-lambda-layers-20250513021721893000000003" -> null
      - bucket_key_enabled            = false -> null
      - content_type                  = "binary/octet-stream" -> null
      - etag                          = "e955d8d9d4d6ac72acc00ef0ea27d3ab-5" -> null
      - force_destroy                 = false -> null
      - id                            = "gasi-lambda-layers-20250513021721893000000003/builds/146ce8c1c2211ece470966661adcfa55bfabfada5c69bc6001be022c8aefd799.zip" -> null
      - key                           = "builds/146ce8c1c2211ece470966661adcfa55bfabfada5c69bc6001be022c8aefd799.zip" -> null
      - metadata                      = {} -> null
      - region                        = "ap-southeast-3" -> null
      - server_side_encryption        = "AES256" -> null
      - source                        = "builds/146ce8c1c2211ece470966661adcfa55bfabfada5c69bc6001be022c8aefd799.zip" -> null
      - storage_class                 = "ONEZONE_IA" -> null
      - tags                          = {} -> null
      - tags_all                      = {
          - "Environment" = "uat"
          - "NAME"        = "sbeacon-backend"
          - "Owner"       = "gaspi"
        } -> null
        # (14 unchanged attributes hidden)
    }

  # module.sbeacon.module.python_libraries_layer.aws_s3_object.lambda_package[0] (deposed object c37e239d) will be destroyed
  # (left over from a partially-failed replacement of this instance)
  - resource "aws_s3_object" "lambda_package" {
      - acl                           = "private" -> null
      - arn                           = "arn:aws:s3:::gasi-lambda-layers-20250513021721893000000003/builds/00872f7f0f46a9ca1b444b165065d07f5bdead9fa47b0069612ec2a3fab69052.zip" -> null
      - bucket                        = "gasi-lambda-layers-20250513021721893000000003" -> null
      - bucket_key_enabled            = false -> null
      - content_type                  = "binary/octet-stream" -> null
      - etag                          = "b594835b21aad5ae334275358af3f5ed-5" -> null
      - force_destroy                 = false -> null
      - id                            = "gasi-lambda-layers-20250513021721893000000003/builds/00872f7f0f46a9ca1b444b165065d07f5bdead9fa47b0069612ec2a3fab69052.zip" -> null
      - key                           = "builds/00872f7f0f46a9ca1b444b165065d07f5bdead9fa47b0069612ec2a3fab69052.zip" -> null
      - metadata                      = {} -> null
      - region                        = "ap-southeast-3" -> null
      - server_side_encryption        = "AES256" -> null
      - source                        = "builds/00872f7f0f46a9ca1b444b165065d07f5bdead9fa47b0069612ec2a3fab69052.zip" -> null
      - storage_class                 = "ONEZONE_IA" -> null
      - tags                          = {} -> null
      - tags_all                      = {
          - "Environment" = "uat"
          - "NAME"        = "sbeacon-backend"
          - "Owner"       = "gaspi"
        } -> null
        # (14 unchanged attributes hidden)
    }

  # module.sbeacon.module.python_libraries_layer.aws_s3_object.lambda_package[0] (deposed object dc315be3) will be destroyed
  # (left over from a partially-failed replacement of this instance)
  - resource "aws_s3_object" "lambda_package" {
      - acl                           = "private" -> null
      - arn                           = "arn:aws:s3:::gasi-lambda-layers-20250513021721893000000003/builds/3561ae79de6e4055e129534af3823910859d2d0e4711b6a12881aa70715f8c36.zip" -> null
      - bucket                        = "gasi-lambda-layers-20250513021721893000000003" -> null
      - bucket_key_enabled            = false -> null
      - content_type                  = "binary/octet-stream" -> null
      - etag                          = "66d3501d559cc4d1e2b2d59e27cb8117-5" -> null
      - force_destroy                 = false -> null
      - id                            = "gasi-lambda-layers-20250513021721893000000003/builds/3561ae79de6e4055e129534af3823910859d2d0e4711b6a12881aa70715f8c36.zip" -> null
      - key                           = "builds/3561ae79de6e4055e129534af3823910859d2d0e4711b6a12881aa70715f8c36.zip" -> null
      - metadata                      = {} -> null
      - region                        = "ap-southeast-3" -> null
      - server_side_encryption        = "AES256" -> null
      - source                        = "builds/3561ae79de6e4055e129534af3823910859d2d0e4711b6a12881aa70715f8c36.zip" -> null
      - storage_class                 = "ONEZONE_IA" -> null
      - tags                          = {} -> null
      - tags_all                      = {
          - "Environment" = "uat"
          - "NAME"        = "sbeacon-backend"
          - "Owner"       = "gaspi"
        } -> null
        # (14 unchanged attributes hidden)
    }

  # module.sbeacon.module.python_libraries_layer.local_file.archive_plan[0] will be created
  + resource "local_file" "archive_plan" {
      + content              = jsonencode(
            {
              + artifacts_dir = "builds"
              + build_plan    = [
                  + [
                      + [
                          + "zip",
                          + "sbeacon/layers/python_libraries/",
                          + null,
                        ],
                    ],
                ]
              + filename      = "builds/9bb66f9b9167880c882dc1e8e39293b5ced117249ae9f7f41bddb2b78516ba6b.zip"
              + runtime       = ""
            }
        )
      + content_base64sha256 = (known after apply)
      + content_base64sha512 = (known after apply)
      + content_md5          = (known after apply)
      + content_sha1         = (known after apply)
      + content_sha256       = (known after apply)
      + content_sha512       = (known after apply)
      + directory_permission = "0755"
      + file_permission      = "0644"
      + filename             = "builds/9bb66f9b9167880c882dc1e8e39293b5ced117249ae9f7f41bddb2b78516ba6b.plan.json"
      + id                   = (known after apply)
    }

  # module.sbeacon.module.python_libraries_layer.null_resource.archive[0] must be replaced
+/- resource "null_resource" "archive" {
      ~ id       = "2425728808555894811" -> (known after apply)
      ~ triggers = { # forces replacement
          ~ "filename"  = "builds/9aaec9d44015c59c2910add19da7d3cbdf8c5e70eadaa851b430d8f7339ee26d.zip" -> "builds/9bb66f9b9167880c882dc1e8e39293b5ced117249ae9f7f41bddb2b78516ba6b.zip"
          ~ "timestamp" = "1758263970736715000" -> "1758271889925715000"
        }
    }

  # module.sbeacon.module.python_libraries_layer.null_resource.archive[0] (deposed object 0ac77927) will be destroyed
  # (left over from a partially-failed replacement of this instance)
  - resource "null_resource" "archive" {
      - id       = "8387499352013748470" -> null
      - triggers = {
          - "filename"  = "builds/758a5cf4322d5633cd248f949e27259bcb25689506b56025e4ef89cfcbad66ae.zip"
          - "timestamp" = "1758168331025077200"
        } -> null
    }

  # module.sbeacon.module.python_libraries_layer.null_resource.archive[0] (deposed object 1a961390) will be destroyed
  # (left over from a partially-failed replacement of this instance)
  - resource "null_resource" "archive" {
      - id       = "7124037960880328052" -> null
      - triggers = {
          - "filename"  = "builds/00872f7f0f46a9ca1b444b165065d07f5bdead9fa47b0069612ec2a3fab69052.zip"
          - "timestamp" = "1758249689693942000"
        } -> null
    }

  # module.sbeacon.module.python_libraries_layer.null_resource.archive[0] (deposed object 694ccc60) will be destroyed
  # (left over from a partially-failed replacement of this instance)
  - resource "null_resource" "archive" {
      - id       = "5872406833242066383" -> null
      - triggers = {
          - "filename"  = "builds/3561ae79de6e4055e129534af3823910859d2d0e4711b6a12881aa70715f8c36.zip"
          - "timestamp" = "1756111483687374200"
        } -> null
    }

  # module.sbeacon.module.python_libraries_layer.null_resource.archive[0] (deposed object 71729597) will be destroyed
  # (left over from a partially-failed replacement of this instance)
  - resource "null_resource" "archive" {
      - id       = "2605805055030014666" -> null
      - triggers = {
          - "filename"  = "builds/146ce8c1c2211ece470966661adcfa55bfabfada5c69bc6001be022c8aefd799.zip"
          - "timestamp" = "1758162488744781000"
        } -> null
    }

  # module.sbeacon.module.python_modules_layer.aws_lambda_layer_version.this[0] must be replaced
+/- resource "aws_lambda_layer_version" "this" {
      ~ arn                         = "arn:aws:lambda:ap-southeast-3:460722568061:layer:sbeacon_backend_python_modules_layer:12" -> (known after apply)
      ~ code_sha256                 = "7MjWaeWqX9/Sl5fgMFnX5Q+E6P2vvEL2P2zQQaJP0mo=" -> (known after apply)
      - compatible_architectures    = [] -> null
      ~ created_date                = "2025-09-19T06:42:39.674+0000" -> (known after apply)
      ~ id                          = "arn:aws:lambda:ap-southeast-3:460722568061:layer:sbeacon_backend_python_modules_layer:12" -> (known after apply)
      ~ layer_arn                   = "arn:aws:lambda:ap-southeast-3:460722568061:layer:sbeacon_backend_python_modules_layer" -> (known after apply)
      ~ s3_key                      = "builds/f725302109ea1bb03b37a134573c33b625324fdd7e0e4dfa2ff1a0bb2b226d63.zip" -> "builds/efd52edf0b92d5c366de2c78a721d135ad86fcd47221358b60ed3213f5a4d53c.zip" # forces replacement
      + s3_object_version           = (known after apply) # forces replacement
      + signing_job_arn             = (known after apply)
      + signing_profile_version_arn = (known after apply)
      + source_code_hash            = (known after apply)
      ~ source_code_size            = 120511 -> (known after apply)
      ~ version                     = "12" -> (known after apply)
        # (7 unchanged attributes hidden)
    }

  # module.sbeacon.module.python_modules_layer.aws_lambda_layer_version.this[0] (deposed object 70ef60ea) will be destroyed
  # (left over from a partially-failed replacement of this instance)
  - resource "aws_lambda_layer_version" "this" {
      - arn                         = "arn:aws:lambda:ap-southeast-3:460722568061:layer:sbeacon_backend_python_modules_layer:11" -> null
      - code_sha256                 = "y1It4cRhtGQ5B6JbkMgvNGrRiWBmSjpsJk1UEWyONDs=" -> null
      - compatible_architectures    = [] -> null
      - compatible_runtimes         = [
          - "python3.12",
        ] -> null
      - created_date                = "2025-09-19T02:44:18.607+0000" -> null
      - description                 = "python libraries" -> null
      - id                          = "arn:aws:lambda:ap-southeast-3:460722568061:layer:sbeacon_backend_python_modules_layer:11" -> null
      - layer_arn                   = "arn:aws:lambda:ap-southeast-3:460722568061:layer:sbeacon_backend_python_modules_layer" -> null
      - layer_name                  = "sbeacon_backend_python_modules_layer" -> null
      - region                      = "ap-southeast-3" -> null
      - s3_bucket                   = "gasi-lambda-layers-20250513021721893000000003" -> null
      - s3_key                      = "builds/31bd390644bc88a4847f305b766bb7715e608910273dd78df02bd957b09d02c3.zip" -> null
      - skip_destroy                = false -> null
      - source_code_size            = 120523 -> null
      - version                     = "11" -> null
        # (5 unchanged attributes hidden)
    }

  # module.sbeacon.module.python_modules_layer.aws_lambda_layer_version.this[0] (deposed object 83562552) will be destroyed
  # (left over from a partially-failed replacement of this instance)
  - resource "aws_lambda_layer_version" "this" {
      - arn                         = "arn:aws:lambda:ap-southeast-3:460722568061:layer:sbeacon_backend_python_modules_layer:10" -> null
      - code_sha256                 = "z2vfE89L+7gIMKLSYyRQgy2KGpL7hiOzYdKREVlxme8=" -> null
      - compatible_architectures    = [] -> null
      - compatible_runtimes         = [
          - "python3.12",
        ] -> null
      - created_date                = "2025-09-18T02:30:59.911+0000" -> null
      - description                 = "python libraries" -> null
      - id                          = "arn:aws:lambda:ap-southeast-3:460722568061:layer:sbeacon_backend_python_modules_layer:10" -> null
      - layer_arn                   = "arn:aws:lambda:ap-southeast-3:460722568061:layer:sbeacon_backend_python_modules_layer" -> null
      - layer_name                  = "sbeacon_backend_python_modules_layer" -> null
      - region                      = "ap-southeast-3" -> null
      - s3_bucket                   = "gasi-lambda-layers-20250513021721893000000003" -> null
      - s3_key                      = "builds/f2562525814e463b43d53a6636a777b84ec20802018b70d36d228f4f22e9e122.zip" -> null
      - skip_destroy                = false -> null
      - source_code_size            = 120523 -> null
      - version                     = "10" -> null
        # (5 unchanged attributes hidden)
    }

  # module.sbeacon.module.python_modules_layer.aws_lambda_layer_version.this[0] (deposed object 98e12c51) will be destroyed
  # (left over from a partially-failed replacement of this instance)
  - resource "aws_lambda_layer_version" "this" {
      - arn                         = "arn:aws:lambda:ap-southeast-3:460722568061:layer:sbeacon_backend_python_modules_layer:9" -> null
      - code_sha256                 = "tPhy3AhPs1GB5jppSj5ezhRSKVFJqq18K3yXrRVYrgY=" -> null
      - compatible_architectures    = [] -> null
      - compatible_runtimes         = [
          - "python3.12",
        ] -> null
      - created_date                = "2025-08-25T08:48:20.619+0000" -> null
      - description                 = "python libraries" -> null
      - id                          = "arn:aws:lambda:ap-southeast-3:460722568061:layer:sbeacon_backend_python_modules_layer:9" -> null
      - layer_arn                   = "arn:aws:lambda:ap-southeast-3:460722568061:layer:sbeacon_backend_python_modules_layer" -> null
      - layer_name                  = "sbeacon_backend_python_modules_layer" -> null
      - region                      = "ap-southeast-3" -> null
      - s3_bucket                   = "gasi-lambda-layers-20250513021721893000000003" -> null
      - s3_key                      = "builds/0734f5877e1e9dad6e8bf79d27e9cb360903b26d528706e609ffd47b61ea9029.zip" -> null
      - skip_destroy                = false -> null
      - source_code_size            = 120494 -> null
      - version                     = "9" -> null
        # (5 unchanged attributes hidden)
    }

  # module.sbeacon.module.python_modules_layer.aws_s3_object.lambda_package[0] must be replaced
+/- resource "aws_s3_object" "lambda_package" {
      ~ arn                           = "arn:aws:s3:::gasi-lambda-layers-20250513021721893000000003/builds/f725302109ea1bb03b37a134573c33b625324fdd7e0e4dfa2ff1a0bb2b226d63.zip" -> (known after apply)
      ~ bucket_key_enabled            = false -> (known after apply)
      + checksum_crc32                = (known after apply)
      + checksum_crc32c               = (known after apply)
      + checksum_crc64nvme            = (known after apply)
      + checksum_sha1                 = (known after apply)
      + checksum_sha256               = (known after apply)
      ~ content_type                  = "application/octet-stream" -> (known after apply)
      ~ etag                          = "eea772b91927bad0e8b6125a435040bb" -> (known after apply)
      ~ id                            = "gasi-lambda-layers-20250513021721893000000003/builds/f725302109ea1bb03b37a134573c33b625324fdd7e0e4dfa2ff1a0bb2b226d63.zip" -> (known after apply)
      ~ key                           = "builds/f725302109ea1bb03b37a134573c33b625324fdd7e0e4dfa2ff1a0bb2b226d63.zip" -> "builds/efd52edf0b92d5c366de2c78a721d135ad86fcd47221358b60ed3213f5a4d53c.zip" # forces replacement
      + kms_key_id                    = (known after apply)
      - metadata                      = {} -> null
      ~ server_side_encryption        = "AES256" -> (known after apply)
      ~ source                        = "builds/f725302109ea1bb03b37a134573c33b625324fdd7e0e4dfa2ff1a0bb2b226d63.zip" -> "builds/efd52edf0b92d5c366de2c78a721d135ad86fcd47221358b60ed3213f5a4d53c.zip"
      - tags                          = {} -> null
      + version_id                    = (known after apply)
        # (14 unchanged attributes hidden)
    }

  # module.sbeacon.module.python_modules_layer.aws_s3_object.lambda_package[0] (deposed object 20cd83fe) will be destroyed
  # (left over from a partially-failed replacement of t
```
</details>
<br>

**Warning**: Output length greater than max comment size. Continued in next comment.